# Лабораторная работа №1
 ## Задача
### Разобраться в создании ветвящихся алгоритмов.
 #### Вариант задания - 9
*Вывести частное произведения параметров a, b и параметра x, если произведение меньше x, и разность иначе. В случае равенства вывести соответствующее сообщение.*
 ## Ход работы:
 1. Разобрать код из примера, понять алгоритм работы с коммандой `if`.
 2. По алгоритму составить блок-схему для выбранного варианта задания.
 3. Действуя алгоритму, указанному в блок-схеме, и по аналогии с программой преподователя написать программу, выполняющую указаное в выбранном варианте задания действие.
 4. Переместить репозиторий, в котором проходила работа на `github`.

 #### Может понадобиться в будущем
 * После `if` должны идти фигурные скобки, в которые заключено действие, выполняющееся при истинности условия.
 * При использовании `if` **ПОСЛЕ УСЛОВИЯ И ДО СКОБОК** не должно быть `;`, иначе программа посчитает что ветка `if` была закончена ещё до скобок.
 * Чтобы в комманде `printf` вывести значение переменной нужно в " " написать `%*`, где `*` зависит от того, какой тип переменной был присвоен. 
 * `diagram.json` - файл с расширением, позволяющим редактировать блок-схему при загрузке файла на `programforyou`, в то время как `diagram.png` позволяет увидеть то, как выглядит блок-схема.

 ### Код
 ```
 #include <stdio.h>
int main ()
{
float a, b, x;
printf("Enter a -> ");
scanf("%f", &a);
printf("Enter b -> ");
scanf("%f", &b);
printf("Enter x -> ");
scanf("%f", &x);

if ((a*b) == x)
    {
    printf("Произведение a и b равно x. \n");
    }
if ((a*b) != x)
    {
    if ((a*b) < x)
        {
        float q=(a*b)/x;
        printf("Частное произведения a и b и x равно %f \n", q);
        }
    if ((a*b) > x)
        {
        float p=(a*b)-x;
        printf("Разность произведения a и b и x равна %f \n", p);
        }
    }
return 0;
} 
 ```
## Скриншоты результата работы
<image src = diagram.png alt="блок-схема">
<image src = "result screenshot.png" alt="вывод кода">